[options]
mode prove

[engines]
smtbmc

[files]
../../rtl/cos_agency_iron_combo.sv
../../rtl/cos_agency_iron_formal.sv

[script]
read_verilog -sv cos_agency_iron_combo.sv
read_verilog -sv cos_agency_iron_formal.sv
prep -top cos_agency_iron_formal
flatten
opt
